planetsLightningArrester/nrf24_stm32/nRF24L01.cpp
/*Planet's Lightning Arrester - 2018*/
/*    Lib based on STM32F103C8      */

#include "nRF24L01.h"
using namespace std;

#define HIGH 1
#define LOW 0

extern TIM_HandleTypeDef htim3;
bool timSet = false;

/*Delay em microsegundos*/
void RF_delay_init(void){
	  TIM_ClockConfigTypeDef sClockSourceConfig;
	  TIM_MasterConfigTypeDef sMasterConfig;
	  htim3.Instance = TIM3;
	  htim3.Init.Prescaler = 1000;
	  htim3.Init.CounterMode = TIM_COUNTERMODE_UP;
	  htim3.Init.Period = 65535;
	  htim3.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
	  htim3.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
	  HAL_TIM_Base_Init(&htim3);

	  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
	  HAL_TIM_ConfigClockSource(&htim3, &sClockSourceConfig);

	  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
	  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
	  HAL_TIMEx_MasterConfigSynchronization(&htim3, &sMasterConfig);

}

void nRF24::microDelay(int multiplo){
	int i = 0;
	for(i = 1; i <= multiplo; i++){
		TIM3->CNT = 0;
		HAL_TIM_Base_Start(&htim3);
		while(TIM3->CNT == 0);
		HAL_TIM_Base_Stop(&htim3);
		TIM3->CNT = 0;
	}
}
/**/

void digitalWrite(uint8_t pin, bool highLow){
    switch(pin){
        case(2):
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(3):
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_14, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(4):
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_15, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(5):
            HAL_GPIO_WritePin(GPIOD, GPIO_PIN_0, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(6):
            HAL_GPIO_WritePin(GPIOD, GPIO_PIN_1, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(10):
            HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(11):
            HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(12):
            HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(13):
            HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(14):
            HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(15):
            HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(16):
            HAL_GPIO_WritePin(GPIOA, GPIO_PIN_6, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(17):
            HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(18):
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(19):
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_1, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(20):
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_2, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(21):
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_10, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(22):
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_11, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(25):
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_12, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(26):
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_13, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(27):
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_14, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(28):
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_15, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(29):
            HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(30):
            HAL_GPIO_WritePin(GPIOA, GPIO_PIN_9, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(31):
            HAL_GPIO_WritePin(GPIOA, GPIO_PIN_10, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(32):
            HAL_GPIO_WritePin(GPIOA, GPIO_PIN_11, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(33):
            HAL_GPIO_WritePin(GPIOA, GPIO_PIN_12, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(34):
            HAL_GPIO_WritePin(GPIOA, GPIO_PIN_13, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(37):
            HAL_GPIO_WritePin(GPIOA, GPIO_PIN_14, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(38):
            HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(39):
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_3, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(40):
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(41):
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(42):
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(43):
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_7, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(45):
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        case(46):
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_9, highLow?GPIO_PIN_SET:GPIO_PIN_RESET);
            break;
        default:
            break;

    }
}

uint8_t nRF24::SPIsend(uint8_t data2Send){
  uint8_t buf2Receive;
  HAL_SPI_TransmitReceive(globalHSPI, &data2Send, &buf2Receive, 1, 100);
  return buf2Receive;
}

void nRF24::setRetries(uint8_t retr, uint16_t delay){
	writeRegister(SETUP_RETR, (((delay/250)-1) << ARD) | retr);
}

nRF24::nRF24(SPI_HandleTypeDef *HSPI, int ce, int csn, uint8_t channel) {
  unsigned int aux;
  unsigned int *address;
  unsigned int baudrateOverTheAir = _2Mbps;
  unsigned int transmitPower = _0dBm;
  unsigned int retries = _15retries;
  unsigned int retriesTimeout = _750us;

  RF_delay_init();

  ce_pin = ce;
  csn_pin = csn;
  globalHSPI = HSPI;

  disableChip();
  deselectSlave();

