planetsLightningArrester/nrf24_stm32/nRF24L01.cpp
  //Set retries = 15 and timeout = 1500us
  setRetries(retries, retriesTimeout);
  //writeRegister(SETUP_RETR, (retriesTimeout << ARD) | (retries << ARC));
  //writeRegister(SETUP_RETR, 0b11111111);

  //Set tx power = -12dbm (0dBm = 1mW, -12dBm = 1mW*10^-1.2 = 63uW)
  aux = readRegister(RF_SETUP);   //read current value
  aux &= ~(0b11 << RF_PWR);       //reset power values
  aux |= (transmitPower << RF_PWR); //set new value
  writeRegister( RF_SETUP, aux ); //write register

  //set datarate (1Mbps default)
  aux = readRegister(RF_SETUP);
  aux &= ~(1 << RF_DR_HIGH);       //set to 1Mbps
  aux &= ~(1 << RF_DR_LOW);        //
  if(baudrateOverTheAir == _250kbps){
	  aux |= 1<<RF_DR_LOW;
  }
  else if(baudrateOverTheAir == _2Mbps){
	  aux |= (1 << RF_DR_HIGH);
	  aux &= ~(1<<RF_DR_LOW);
  }
  writeRegister( RF_SETUP, aux );

  //set dynamicpayload off
  writeRegister(DYNPD, 0);

  //reset receive, transmit and max retransmits flags
  writeRegister(STATUS, 1 << RX_DR | 1 << TX_DS | 1 << MAX_RT);

  //set IRQ pin to set when receive data
  aux = readRegister(CONFIG) | 1 << MASK_TX_DS | 1 << MASK_MAX_RT | 1 << MASK_RX_DR; // Removed RX data ready interruption
  writeRegister(CONFIG, aux) ;

  //set CRC enabled
  aux = readRegister(CONFIG) | 1 << CRCO | 1 << EN_CRC; //CRCO define 2 bytes of CRC
  writeRegister(CONFIG, aux) ;

  //set channel (76 is the default)
  writeRegister(RF_CH, channel < 125 ? channel : 125);

  //set _pipe active
  pipesActives[0] = true;
  writeRegister(EN_RXADDR, pipesActives[ERX_P0] << ERX_P0 | pipesActives[ERX_P1] << ERX_P1 | pipesActives[ERX_P2] << ERX_P2 | pipesActives[ERX_P3] << ERX_P3 | pipesActives[ERX_P4] << ERX_P4 | pipesActives[ERX_P5] << ERX_P5);

  //set pipes
  writeRegisterManyTimes(TX_ADDR, _defaultAddressPipe0, 5);

  address = _defaultAddressPipe0;
  writeRegisterManyTimes(RX_ADDR_P0, address, 5);
  writeRegister(RX_PW_P0, pipePackageSize[0]);

  address = _defaultAddressPipe1;
  writeRegisterManyTimes(RX_ADDR_P1, address, 5);
  writeRegister(RX_PW_P1, pipePackageSize[1]);

  address = _defaultAddressPipe2;
  writeRegister(RX_ADDR_P2, address[4]);
  writeRegister(RX_PW_P2, pipePackageSize[2]);

  address = _defaultAddressPipe3;
  writeRegister(RX_ADDR_P3, address[4]);
  writeRegister(RX_PW_P3, pipePackageSize[3]);

  address = _defaultAddressPipe4;
  writeRegister(RX_ADDR_P4, address[4]);
  writeRegister(RX_PW_P4, pipePackageSize[4]);

  address = _defaultAddressPipe5;
  writeRegister(RX_ADDR_P5, address[4]);
  writeRegister(RX_PW_P5, pipePackageSize[5]);

  //stop listening
  disableChip();
  writeRegister(FLUSH_TX, NOP);
  writeRegister(FLUSH_RX, NOP);

  //enable dynamic payload and ack + payload
  writeRegister(FEATURE, readRegister(FEATURE) | 1<<EN_DPL | 1<<EN_ACK_PAY);
  writeRegister(DYNPD, 0x3F);

  enterRXmode();

}

uint8_t nRF24::send(const char* _data, unsigned int _size, unsigned int _pipe) {

  if(_size > 32)
	  _size = 32;

  if(!inTxMode){
	  inTxMode = true;
	  usingPipe = _pipe;
	  enterTXmode(_pipe);
	  //enableChip();
  }
  else{
	  if(usingPipe != _pipe){
		  usingPipe = _pipe;
		  enterTXmode(_pipe);
          //enableChip();
	  }
	  microDelay(6);
    writeRegister(STATUS, (1<<RX_DR) | (1<<TX_DS) | (1<<MAX_RT) );
  }

  selectSlave();

  SPIsend(W_TX_PAYLOAD);
  while (_size--)
	SPIsend(*_data++);

  deselectSlave();

  enableChip();
  microDelay(10);	//	Alterado de 30 para 10
  disableChip();

  return msgSize();

}

/*
*-burstSend: send messages without getting out of TX mode. Only works with ShockBusrts enabled (default).
*Obs: See page 22 for FSM
*/

uint8_t nRF24::burstSend(const char* _data, unsigned int _size, unsigned int _pipe) {

  if(_size > 32)
	  _size = 32;

  if(!inTxMode){
	  inTxMode = true;
	  usingPipe = _pipe;
	  enterTXmode(_pipe);
	  enableChip();
  }
  else{
	  if(usingPipe != _pipe){
		  usingPipe = _pipe;
		  enterTXmode(_pipe);
          enableChip();
	  }
	  microDelay(6);    //Minimum delay for proper operation
      writeRegister(STATUS, (1<<RX_DR) | (1<<TX_DS) | (1<<MAX_RT) );
  }

  selectSlave();

  SPIsend(W_TX_PAYLOAD);
  while (_size--)
	SPIsend(*_data++);

  deselectSlave();

  return msgSize();

}

/*
*-bareSend: send messages without getting out of TX mode. Only works with ShockBusrts enabled (default).
*Obs: See page 22 for FSM
*/

void nRF24::bareSend(const char* _data, unsigned int _size, unsigned int _pipe) {

    enableChip();

    microDelay(6);    //Minimum delay for proper operation
    writeRegister(STATUS, (1<<RX_DR) | (1<<TX_DS) | (1<<MAX_RT) );

    selectSlave();

    SPIsend(W_TX_PAYLOAD);
    for(int i = 32; i > 0; i--, _size--){
        if(_size > 0)
            SPIsend(*_data++);
        else
            SPIsend(0);
    }
    deselectSlave();

}

void nRF24::sendInTheNextReceive(const char* _data, unsigned int _size, unsigned int _pipe){
	if(_size >32)
		_size = 32;

	selectSlave();

	SPIsend(W_ACK_PAYLOAD | _pipe);
	while (_size--)
		SPIsend(*_data++);

	deselectSlave();
}

void nRF24::Flush(){
	writeRegister(FLUSH_TX, NOP);
	writeRegister(FLUSH_RX, NOP);
}

void nRF24::read(char* _data) {
  int _size;

  _size = readRegister(R_RX_PL_WID);

  selectSlave();

  SPIsend(R_RX_PAYLOAD);
  for (int i = 0; i < _size; i++)
    _data[i] = SPIsend(NOP);

  deselectSlave();

  resetReceiveFlag();

}

void nRF24::pipe0address(unsigned int* address){
  _defaultAddressPipe0[0] = address[0];
  _defaultAddressPipe0[1] = address[1];
  _defaultAddressPipe0[2] = address[2];
  _defaultAddressPipe0[3] = address[3];
  _defaultAddressPipe0[4] = address[4];
  _defaultAddressPipe0[5] = address[5];

  writeRegister(CONFIG, readRegister(CONFIG) | (1<<PWR_UP) | (1<<PRIM_RX));
  writeRegister(STATUS, (1<<RX_DR) | (1<<TX_DS) | (1<<MAX_RT) );

  if (!pipesActives[0])
    enablePipe(0);

  writeRegisterManyTimes(TX_ADDR, address, 5);
  writeRegisterManyTimes(RX_ADDR_P0, address, 5);
  writeRegister(RX_PW_P0, pipePackageSize[0]);

  writeRegister(FLUSH_TX, NOP);
  writeRegister(FLUSH_RX, NOP);
  enableChip();
  microDelay(1);
}

