planetsLightningArrester/nrf24_stm32/nRF24L01.cpp
void nRF24::pipe1address(unsigned int* address){
  _defaultAddressPipe1[0] = address[0];
  _defaultAddressPipe1[1] = address[1];
  _defaultAddressPipe1[2] = address[2];
  _defaultAddressPipe1[3] = address[3];
  _defaultAddressPipe1[4] = address[4];

  _defaultAddressPipe2[0] = address[0];
  _defaultAddressPipe2[1] = address[1];
  _defaultAddressPipe2[2] = address[2];
  _defaultAddressPipe2[3] = address[3];
  _defaultAddressPipe2[4] = address[4];

  _defaultAddressPipe3[0] = address[0];
  _defaultAddressPipe3[1] = address[1];
  _defaultAddressPipe3[2] = address[2];
  _defaultAddressPipe3[3] = address[3];
  _defaultAddressPipe3[4] = address[4];

  _defaultAddressPipe4[0] = address[0];
  _defaultAddressPipe4[1] = address[1];
  _defaultAddressPipe4[2] = address[2];
  _defaultAddressPipe4[3] = address[3];
  _defaultAddressPipe4[4] = address[4];

  _defaultAddressPipe5[0] = address[0];
  _defaultAddressPipe5[1] = address[1];
  _defaultAddressPipe5[2] = address[2];
  _defaultAddressPipe5[3] = address[3];
  _defaultAddressPipe5[4] = address[4];

  _defaultAddressPipe1[5] = address[5];

  writeRegister(CONFIG, readRegister(CONFIG) | (1<<PWR_UP) | (1<<PRIM_RX));
  writeRegister(STATUS, (1<<RX_DR) | (1<<TX_DS) | (1<<MAX_RT) );

  if (!pipesActives[1])
    enablePipe(1);

  writeRegisterManyTimes(TX_ADDR, address, 5);
  writeRegisterManyTimes(RX_ADDR_P1, address, 5);
  writeRegister(RX_PW_P1, 32);

  writeRegister(FLUSH_TX, NOP);
  writeRegister(FLUSH_RX, NOP);
  enableChip();
  microDelay(1);
}

void nRF24::pipe2address(unsigned int address){
  _defaultAddressPipe2[4] = address;

  writeRegister(CONFIG, readRegister(CONFIG) | (1<<PWR_UP) | (1<<PRIM_RX));
  writeRegister(STATUS, (1<<RX_DR) | (1<<TX_DS) | (1<<MAX_RT) );

  if (!pipesActives[2])
    enablePipe(2);

  writeRegisterManyTimes(TX_ADDR, _defaultAddressPipe2, 5);
  writeRegister(RX_ADDR_P2, _defaultAddressPipe2[4]);
  writeRegister(RX_PW_P2, 32);

  writeRegister(FLUSH_TX, NOP);
  writeRegister(FLUSH_RX, NOP);
  enableChip();
  microDelay(1);
}

void nRF24::pipe3address(unsigned int address){
  _defaultAddressPipe3[4] = address;

  writeRegister(CONFIG, readRegister(CONFIG) | (1<<PWR_UP) | (1<<PRIM_RX));
  writeRegister(STATUS, (1<<RX_DR) | (1<<TX_DS) | (1<<MAX_RT) );

  if (!pipesActives[3])
    enablePipe(3);

  writeRegisterManyTimes(TX_ADDR, _defaultAddressPipe3, 5);
  writeRegister(RX_ADDR_P3, _defaultAddressPipe3[4]);
  writeRegister(RX_PW_P3, 32);

  writeRegister(FLUSH_TX, NOP);
  writeRegister(FLUSH_RX, NOP);
  enableChip();
  microDelay(1);
}

void nRF24::pipe4address(unsigned int address){
  _defaultAddressPipe4[4] = address;

  writeRegister(CONFIG, readRegister(CONFIG) | (1<<PWR_UP) | (1<<PRIM_RX));
  writeRegister(STATUS, (1<<RX_DR) | (1<<TX_DS) | (1<<MAX_RT) );

  if (!pipesActives[4])
    enablePipe(4);

  writeRegisterManyTimes(TX_ADDR, _defaultAddressPipe4, 5);
  writeRegister(RX_ADDR_P4, _defaultAddressPipe4[4]);
  writeRegister(RX_PW_P4, 32);

  writeRegister(FLUSH_TX, NOP);
  writeRegister(FLUSH_RX, NOP);
  enableChip();
  microDelay(1);
}

void nRF24::pipe5address(unsigned int address){
  _defaultAddressPipe5[4] = address;

  writeRegister(CONFIG, readRegister(CONFIG) | (1<<PWR_UP) | (1<<PRIM_RX));
  writeRegister(STATUS, (1<<RX_DR) | (1<<TX_DS) | (1<<MAX_RT) );

  if (!pipesActives[5])
    enablePipe(5);

  writeRegisterManyTimes(TX_ADDR, _defaultAddressPipe5, 5);
  writeRegister(RX_ADDR_P5, _defaultAddressPipe5[4]);
  writeRegister(RX_PW_P5, 32);

  writeRegister(FLUSH_TX, NOP);
  writeRegister(FLUSH_RX, NOP);
  enableChip();
  microDelay(1);
}

void nRF24::changeChannel(uint8_t channel) {
	writeRegister(RF_CH, channel < 125 ? channel : 125);
}

void nRF24::changeSpeed(uint8_t speed){
    uint8_t aux;
    //set datarate (1Mbps default)
    aux = readRegister(RF_SETUP);
    aux &= ~(1 << RF_DR_HIGH);       //set to 1Mbps
    aux &= ~(1 << RF_DR_LOW);        //
    if(speed == _250kbps){
        aux |= 1<<RF_DR_LOW;
    }
    else if(speed == _2Mbps){
        aux |= (1 << RF_DR_HIGH);
        aux &= ~(1<<RF_DR_LOW);
    }
    writeRegister( RF_SETUP, aux );
}

void nRF24::powerDown(){
    writeRegister(CONFIG, readRegister(CONFIG) & ~(1<<PWR_UP));
}

void nRF24::powerUp(){
    writeRegister(CONFIG, readRegister(CONFIG) | (1<<PWR_UP));
}

void nRF24::enableBareSend(uint8_t pipe){

    unsigned int* address;

    disableChip();

    writeRegister(EN_AA, 0);        //Disable auto ack per pipe
    writeRegister(SETUP_RETR, 0);   //Disable retries
    writeRegister(DYNPD, 0);        //Disable dynamic payload per pipe, cause it requires auto ack
    writeRegister(FEATURE, 0);      //Disable dynamic payload and ack

    //Disable interrupt pins
    //Disable CRC
    //Power up and put it into TX mode
    writeRegister(CONFIG, (1<<MASK_RX_DR) | (1<<MASK_TX_DS) | (1<<MASK_MAX_RT) | (0<<EN_CRC) | (0<<CRCO) | (1<<PWR_UP) | (0<<PRIM_RX));
    microDelay(20);
    resetFlags();

    switch (pipe) {
    case 0:
      cachePipeAddress = 0;
      address = _defaultAddressPipe0;
      break;
    case 1:
      cachePipeAddress = 1;
      address = _defaultAddressPipe1;
      break;
    case 2:
      cachePipeAddress = 2;
      address = _defaultAddressPipe2;
      break;
    case 3:
      cachePipeAddress = 3;
      address = _defaultAddressPipe3;
      break;
    case 4:
      cachePipeAddress = 4;
      address = _defaultAddressPipe4;
      break;
    case 5:
      cachePipeAddress = 5;
      address = _defaultAddressPipe5;
      break;
    default:
      cachePipeAddress = 0;
      address = _defaultAddressPipe0;
      break;
  }

  if (!pipesActives[pipe])
    enablePipe(pipe);

  writeRegisterManyTimes(TX_ADDR, address, 5);
  writeRegisterManyTimes(RX_ADDR_P0, address, 5);
  writeRegister(RX_PW_P0, pipePackageSize[cachePipeAddress]);
  if(pipe ==1){
	  writeRegisterManyTimes(RX_ADDR_P0 + pipe, _defaultAddressPipe0, 5);
	}
	else if(pipe >= 2 && pipe <=5){
	  writeRegister(RX_ADDR_P0 + pipe, _defaultAddressPipe0[4]);
	}

  writeRegister(FLUSH_TX, NOP);
  writeRegister(FLUSH_RX, NOP);


