planetsLightningArrester/nrf24_stm32/nRF24L01.cpp
}

void nRF24::enterRXmode() {

    disableChip();

	writeRegister(CONFIG, readRegister(CONFIG) | (1<<PWR_UP) | (1<<PRIM_RX));
	//writeRegister(CONFIG, 0x0F);
	writeRegister(STATUS, (1<<RX_DR) | (1<<TX_DS) | (1<<MAX_RT) );

	writeRegisterManyTimes(TX_ADDR, _defaultAddressPipe0, 5);
	writeRegisterManyTimes(RX_ADDR_P0, _defaultAddressPipe0, 5);
	writeRegister(RX_PW_P0, pipePackageSize[0]);

	writeRegister(FLUSH_TX, NOP);
	writeRegister(FLUSH_RX, NOP);
	enableChip();
	microDelay(1);
}

void nRF24::enterTXmode(unsigned int _pipe) {

  unsigned int* address;

  switch (_pipe) {
    case 0:
      cachePipeAddress = 0;
      address = _defaultAddressPipe0;
      break;
    case 1:
      cachePipeAddress = 1;
      address = _defaultAddressPipe1;
      break;
    case 2:
      cachePipeAddress = 2;
      address = _defaultAddressPipe2;
      break;
    case 3:
      cachePipeAddress = 3;
      address = _defaultAddressPipe3;
      break;
    case 4:
      cachePipeAddress = 4;
      address = _defaultAddressPipe4;
      break;
    case 5:
      cachePipeAddress = 5;
      address = _defaultAddressPipe5;
      break;
    default:
      cachePipeAddress = 0;
      address = _defaultAddressPipe0;
      break;
  }

  disableChip();

  if (!pipesActives[_pipe])
    enablePipe(_pipe);

  writeRegister(CONFIG, 0x0E);
  resetFlags();

  writeRegisterManyTimes(TX_ADDR, address, 5);
  writeRegisterManyTimes(RX_ADDR_P0, address, 5);
  writeRegister(RX_PW_P0, pipePackageSize[cachePipeAddress]);
  if(_pipe ==1){
	  writeRegisterManyTimes(RX_ADDR_P0 + _pipe, _defaultAddressPipe0, 5);
	}
	else if(_pipe >= 2 && _pipe <=5){
	  writeRegister(RX_ADDR_P0 + _pipe, _defaultAddressPipe0[4]);
	}

  writeRegister(FLUSH_TX, NOP);
  writeRegister(FLUSH_RX, NOP);
}

void nRF24::exitTXmode(){

	writeRegisterManyTimes(TX_ADDR, _defaultAddressPipe0, 5);
	writeRegisterManyTimes(RX_ADDR_P0, _defaultAddressPipe0, 5);
	writeRegister(RX_PW_P0, pipePackageSize[0]);

	if(cachePipeAddress != 0){
        if(cachePipeAddress == 1)
            writeRegisterManyTimes(RX_ADDR_P1, _defaultAddressPipe1, 5);
        else if(cachePipeAddress == 2)
            writeRegister(RX_ADDR_P2, _defaultAddressPipe2[4]);
        else if(cachePipeAddress == 3)
            writeRegister(RX_ADDR_P3, _defaultAddressPipe3[4]);
        else if(cachePipeAddress == 4)
            writeRegister(RX_ADDR_P4, _defaultAddressPipe4[4]);
        else
            writeRegister(RX_ADDR_P5, _defaultAddressPipe5[4]);

        writeRegister(RX_PW_P0 + cachePipeAddress, pipePackageSize[cachePipeAddress]);
	}

}

void nRF24::writeRegister(unsigned int reg, unsigned int _data) {

  selectSlave();
  SPIsend(W_REGISTER | reg);
  SPIsend(_data);
  deselectSlave();

}

void nRF24::writeRegisterManyTimes(unsigned int reg, unsigned int* _data, int nBytes) {
	int i;
	selectSlave();
	SPIsend(W_REGISTER | reg);
	for (i = nBytes - 1; i >= 0; i--)
		SPIsend(_data[i]);
	deselectSlave();
}

unsigned int nRF24::readRegister(unsigned int reg) {
  unsigned int _data;

  selectSlave();
  SPIsend(R_REGISTER | reg);
  _data = SPIsend(NOP);
  deselectSlave();

  return _data;
}

void nRF24::readRegisterManyTimes(unsigned int reg, unsigned int* _data, int nBytes) {
  int index = 0;

  selectSlave();
  SPIsend(R_REGISTER | reg);
  while(nBytes--){
    _data[index] = SPIsend(NOP);
    index++;
  }
  deselectSlave();

}

//Returns false if didn't receive anything. Returns (_pipe_n +1) when receive anything from the _pipe number _pipe_n
volatile unsigned int nRF24::available() {
	if(inTxMode){
		inTxMode = false;
		exitTXmode();
		enterRXmode();
	}
    else{
        writeRegister(STATUS, (1<<RX_DR) | (1<<TX_DS) | (1<<MAX_RT) );
    }
	if ((~readRegister(FIFO_STATUS)) & (1<<RX_EMPTY)) {
		unsigned int receivedFromPipe = (readRegister(STATUS) & 0b1110) >> 1;
		return receivedFromPipe + 1;
	}
	else
		return false;
}

volatile unsigned int nRF24::bareAvailable(){
    disableChip();
    if ((~readRegister(FIFO_STATUS)) & (1<<RX_EMPTY)) {
		unsigned int receivedFromPipe = (readRegister(STATUS) & 0b1110) >> 1;
		return receivedFromPipe + 1;
	}
	else
		return false;
}

uint8_t nRF24::checkRetries(){
	return readRegister((STATUS) & (1<<MAX_RT));
}

bool nRF24::isRadioInRange(){
    return readRegister(RPD);
}

void nRF24::enablePipe(unsigned int _pipe) {
  pipesActives[_pipe] = true;
  writeRegister(EN_RXADDR, pipesActives[ERX_P0] << ERX_P0 | pipesActives[ERX_P1] << ERX_P1 | pipesActives[ERX_P2] << ERX_P2 | pipesActives[ERX_P3] << ERX_P3 | pipesActives[ERX_P4] << ERX_P4 | pipesActives[ERX_P5] << ERX_P5);
}

void nRF24::disablePipe(unsigned int _pipe) {
  pipesActives[_pipe] = false;
  writeRegister(EN_RXADDR, pipesActives[ERX_P0] << ERX_P0 | pipesActives[ERX_P1] << ERX_P1 | pipesActives[ERX_P2] << ERX_P2 | pipesActives[ERX_P3] << ERX_P3 | pipesActives[ERX_P4] << ERX_P4 | pipesActives[ERX_P5] << ERX_P5);
}

void nRF24::resetFlags(){
    writeRegister(STATUS, (1<<RX_DR) | (1<<TX_DS) | (1<<MAX_RT) );
}

unsigned int nRF24::msgSize() {
	if ((~readRegister(FIFO_STATUS)) & (1<<RX_EMPTY)) {
		return readRegister(R_RX_PL_WID);
	}
	else{
		return 0;
	}
}

void nRF24::resetReceiveFlag() {
  writeRegister(STATUS, 1 << RX_DR);
}

void nRF24::enableChip() {
  digitalWrite(ce_pin, HIGH);
}

void nRF24::disableChip() {
  digitalWrite(ce_pin, LOW);
}

void nRF24::selectSlave(){
	digitalWrite(csn_pin, LOW);
}

void nRF24::deselectSlave(){
	digitalWrite(csn_pin, HIGH);
}
